<?php

return [
    /*
    |--------------------------------------------------------------------------
    | SPA URL
    |--------------------------------------------------------------------------
    |
    | URL SPA страницы приложения, используется в качестве формирования ссылок
    | при отправке писем
    |
    */
    'url' => env('SPA_URL', 'http://localhost:8080'),

    /*
    |--------------------------------------------------------------------------
    | Paths
    |--------------------------------------------------------------------------
    |
    | Пути для URL SPA, которые будут восприняты SPA и обработаны, используется
    | для формирования ссылок при отправке писем, например, для восстановления
    | пароля, подтверждения владением почтой и т.д.
    |
    */
    'paths' => [
        'verify_email' => env('SPA_VERIFY_EMAIL_PATH', '/verify-email'),
        'reset_password' => env('SPA_RESET_PASSWORD_PATH', '/reset-password'),
    ],
];
